title: Quick Execution of a Series of Suspicious Commands
id: 61ab5496-748e-4818-a92f-de78e20fe1f1
description: Detects multiple suspicious process in a limited timeframe
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine:
            - whoami
            - quser
            - hostname
    timeframe: 10s
    condition: selection | count() by MachineName >= 3